app/Activity.php

    public static function feed($user, $take= 50){

        return static::where('user_id', $user->id)
        ->latest()
        ->with('subject')
        ->take($take)
        ->get()
        ->groupBy(function ($activity){
            return $activity->created_at->format('Y-m-d');
        });
---
select * from `activities` where `user_id` = 39 order by `created_at` desc limit 50