app/Reply.php

update `threads` set `replies_count` = `replies_count` + 1, `updated_at` = '2019-06-11 02:23:28' where `id` = 44
update `threads` set `replies_count` = `replies_count` - 1, `updated_at` = '2019-06-11 02:20:52' where `id` = 44
---
    protected static function boot(){
        parent::boot();

        static::created(function ($reply){
            $reply->thread->increment('replies_count');
        });

        static::deleted(function ($reply){
            $reply->thread->decrement('replies_count');