app/Filters/ThreadFilters.php

    protected function by($username)
    {
        $user = User::where('name', $username)->firstOrFail();
---
select * from `users` where `name` = 'fisherman' limit 1