app/Http/Controllers/ReplyController.php

    public function update(Reply $reply)
    {
        $this->authorize('update', $reply);

        $reply->update(['body'=>request('body')]);
---
update `replies` set `body` = 'Cadwadawdawdwadwadadwadwadwadwadwa', `updated_at` = '2019-06-11 02:21:00' where `id` = 87

    public function destroy(Reply $reply)
    {
        $this->authorize('update', $reply);

        $reply->delete();
---
delete from `replies` where `id` = 86